# Tilt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..Tilt Property
EnergyAnalysisSurface Class See Also
---
The tilt angle for this surface.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Tilt { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Tilt As Double
	Get
```

Visual C++
---
```text
public:
property double Tilt {
	double get ();
}
```

# Remarks
The tilt is computed as the angle of rotation between the outward normal of the surface and the Z-axis.
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace